<a href="https://colab.research.google.com/github/maryline321/datascience/blob/main/DatetimeIndex.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Extract month and year from column in Pandas, create new column**

In [21]:
import pandas as pd
import numpy as np
import datetime

In [22]:
raw_data = {'name': ['Maryline Chebet', 'Caroh Jones', 'Rita Sanchez', 'Sly Rop'],
'age': [19, 20, 22, 21],
'favorite_color': ['blue', 'red', 'yellow', "green"],
'grade': [88, 92, 95, 70],
'birth_date': ['01-02-1996', '08-05-1997', '04-28-1996', '12-16-1995']}
df = pd.DataFrame(raw_data, index = ['Maryline Chebet', 'Caroh Jones', 'Rita Sanchez', 'Sly Rop'])
df

                            name  age favorite_color  grade  birth_date
Maryline Chebet  Maryline Chebet   19           blue     88  01-02-1996
Caroh Jones          Caroh Jones   20            red     92  08-05-1997
Rita Sanchez        Rita Sanchez   22         yellow     95  04-28-1996
Sly Rop                  Sly Rop   21          green     70  12-16-1995

In [23]:
# extract year from string format date
df['year']=pd.DatetimeIndex(df['birth_date']).year
df

                            name  age favorite_color  grade  birth_date  year
Maryline Chebet  Maryline Chebet   19           blue     88  01-02-1996  1996
Caroh Jones          Caroh Jones   20            red     92  08-05-1997  1997
Rita Sanchez        Rita Sanchez   22         yellow     95  04-28-1996  1996
Sly Rop                  Sly Rop   21          green     70  12-16-1995  1995

In [24]:
df['month']=pd.DatetimeIndex(df['birth_date']).month
df

                            name  age favorite_color  ...  birth_date  year  month
Maryline Chebet  Maryline Chebet   19           blue  ...  01-02-1996  1996      1
Caroh Jones          Caroh Jones   20            red  ...  08-05-1997  1997      8
Rita Sanchez        Rita Sanchez   22         yellow  ...  04-28-1996  1996      4
Sly Rop                  Sly Rop   21          green  ...  12-16-1995  1995     12

[4 rows x 7 columns]

In [25]:
#del df["date"]

In [26]:
df

                            name  age favorite_color  ...  birth_date  year  month
Maryline Chebet  Maryline Chebet   19           blue  ...  01-02-1996  1996      1
Caroh Jones          Caroh Jones   20            red  ...  08-05-1997  1997      8
Rita Sanchez        Rita Sanchez   22         yellow  ...  04-28-1996  1996      4
Sly Rop                  Sly Rop   21          green  ...  12-16-1995  1995     12

[4 rows x 7 columns]

In [27]:
#if the date format comes in datetime, we can also extract the day/month/year using the to_period function
#where 'D', 'M', 'Y' are inputs

df['month_year'] = pd.to_datetime(df['birth_date']).dt.to_period('M')
df.head()

                            name  age favorite_color  ...  year month  month_year
Maryline Chebet  Maryline Chebet   19           blue  ...  1996     1     1996-01
Caroh Jones          Caroh Jones   20            red  ...  1997     8     1997-08
Rita Sanchez        Rita Sanchez   22         yellow  ...  1996     4     1996-04
Sly Rop                  Sly Rop   21          green  ...  1995    12     1995-12

[4 rows x 8 columns]